{
  "basics": {
    "name": "Michael Senejoa",
    "label": "Front End Developer",
    "picture": "./profilepicture.jpg",
    "email": "michaelsenejoa@gmail.com",
    "phone": "4074630247",
    "website": "http://github.com/msenejoa",
    "summary": "I began my career as an Electrical Engineer where I learned many types signal processes, logic and algorithms. Early on my path, I found my footing in analog electronics building modular synthesizers. My interests evolved into using microcontrollers for personal and professional projects. As embedded systems and sensors became more widely available I began using python for data processing and back end processing. My obsession with data analysis lead me become proficient in data visualization eventually leading to web development with JavaScript (ES6), HTML, CSS, SQL, JSON, React and Redux.",
    "location": {
      "address": "Brooklyn",
      "postalCode": "11216",
      "city": "Brooklyn",
      "countryCode": "NY",
      "region": "NSW"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "jonbloomer",
        "url": ""
      },
      {
        "network": "Github",
        "username": "msenejoa",
        "url": ""
      }
    ]
  },
  "work": [
    {
      "company": "Tokéndex",
      "position": "Principle Developer",
      "website": "https://itunes.apple.com/us/app/tokendex/id1273909946?mt=8",
      "startDate": "2017-06-01",
      "endDate": "",
      "summary": "Developed an iOS app utilizing React Native, Redux, redux-thunk and Expo to monitor blockchain cryptocurrencies, visualize trends in token prices, build a virtual portfolio, set the holdings of each currency to calculate the portfolio value. The project’s source code can be found on my github page. The application can be found on the App Store.",
      "highlights": []
    },
    {
      "company": "The LiRo Group",
      "position": "Project Engineer",
      "website": "https://www.governor.ny.gov/news/governor-cuomo-announces-transformational-plan-reimagine-new-york-s-bridges-and-tunnels-21st",
      "startDate": "2017-04-01",
      "endDate": "",
      "summary": "As a Project Engineer I oversaw and inspected the installation of a synchronized LED light show on the Marine Parkway Bridge commissioned by Governor Cuomo. This included coordinating with the Philips, designers, contractors, electricians, and the Tri-Borough Transit Authority (TBTA)  to ensure the phases of the project were completed in a timely and professional manner.",
      "highlights": []
    },
    {
      "company": "Shapeways",
      "position": "3D Printing Engineer",
      "website": "http://www.shapeways.com",
      "startDate": "2015-10-01",
      "endDate": "2017-03-01",
      "summary": "An industry leader in a 3D printing marketplace. I worked closely with supply chain to plan 3D builds accordingly to reduce lead time and minimize late PO’s. I also analyzed customer meshes (obj, stl) to ensure printability. Used SQL, Python/Flask, JavaScript to visualize the order pipeline and lead times. I built web apps for the management team to visualize trends in various categories using custom written SQL queries.  Designed a web application using Flask/SQLite/JavaScript that tracked and displayed the quality of machined parts in order to ensure consistency among builds. Assisted in the automation of planning builds using Python, SQL and Selenium to work with our existing back end. ",
      "highlights": []
    },
    {
      "company": "Alchvmy",
      "position": "Jewelry Design CAD",
      "website": "https://www.shapeways.com/shops/senejoa",
      "startDate": "2015-05-01",
      "endDate": "",
      "summary": "All design was done utilizing Rhino CAD, Blender, onShape, Sculptress, and Adobe Mudbox. I manipulate 3D scans of animals and animal bones found on the internet and design them into 3D printable jewelry items. The jewelry is available in bronze, brass, silver and gold. ",
      "highlights": []
    },
    {
      "company": "gCreate",
      "position": "Manufacturing Engineer",
      "website": "http://www.gcreate.com/",
      "startDate": "2014-12-01",
      "endDate": "2015-10-01",
      "summary": "As part of a successful kickstarter campaign, we used large format 3D printers to manufacture parts to produce more 3D printers. This also included wiring all the electronics and sensors, tweaking/uploading open source firmware to microcontrollers, and testing each printer before shipping it out. ",
      "highlights": []
    },
    {
      "company": "Pedal Power NYC - The Human Grid",
      "position": "Embedded Systems Intern",
      "website": "http://www.pedalpowernyc.org/",
      "startDate": "2013-06-01",
      "endDate": "2014-01-01",
      "summary": "Assisting in the documentation and design for a smart bicycle powered generator to power live concerts as part of an Open Source project. This included sensors on custom built bicycles, documenting wiring diagrams and network protocols to track how much power a user is inputting into the system. ",
      "highlights": []
    },
    {
      "company": "Senior Design",
      "position": "Electrical Engineer",
      "website": "http://www.eecs.ucf.edu/seniordesign/fa2010sp2011/g18/video.html",
      "startDate": "2010-08-01",
      "endDate": "2011-05-01",
      "summary": "Designed, documented and constructed an analog and digital musical synthesizer. Tasks included simulating the circuits, designing and manufacturing PCB, programming and uploading firmware to microcontrollers, soldering electronics and testing the final product. Other task included a budget const analysis and a critical path analysis for a time and efficient execution of milestones and goals.",
      "highlights": []
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "College of Electrical Engineering and Computer Science, UCF",
      "area": "Electrical Engineer",
      "studyType": "Bachelor",
      "startDate": "2007-08-01",
      "endDate": "2011-05-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Front End Development",
      "level": "Master",
      "keywords": [
        "Python",
        "SQL",
        "HTML",
        "CSS",
        "Javascript",
        "ES2015",
        "React",
        "React Native",
        "Redux",
        "redux-thunk",
        "Babel",
        "Bootstrap",
        "Node",
        "MySQL",
        "Github",
        "Responsive",
        "3D Printing",
        "CAD"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Guitar",
      "keywords": []
    }
  ],
  "references": []
}
