{
  "basics": {
    "name": "Michael Senejoa",
    "label": "Front End Developer",
    "picture": "./profilepicture.jpg",
    "email": "michaelsenejoa@gmail.com",
    "phone": "",
    "website": "http://github.com/msenejoa",
    "summary": "Web Developer with 3+ years of experience in developing websites using primarily Node.js. Expertise include designing front end interfaces using functional React.js with a context/provider pattern for state management and creating reusable components. Backend experience includes building out Express.js servers for RESTful API with MongoDB and CouchDB. Graduated with a Bachelor of Science in Electrical Engineering.",
    "location": {
      "address": "Brooklyn",
      "postalCode": "11216",
      "city": "Brooklyn",
      "countryCode": "NY",
      "region": "NSW"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "jonbloomer",
        "url": ""
      },
      {
        "network": "Github",
        "username": "msenejoa",
        "url": "https://github.com/msenejoa"
      }
    ]
  },
  "work": [
    {
      "company": "Databyss",
      "position": "Javascript Developer",
      "website": "https://Databyss.org",
      "startDate": "2017-05-01",
      "endDate": "",
      "summary": "Javascript Developer for an open source project that can be found at Databyss.org. Developed a web based rich text editor which catalogs topics and citations for research purposes. Worked collaboratively using git and CI for development. Creat- ed an API for handling CRUD requests using Express.js, MongoDB and Jest for unit testing. Developed functional React UI components using Storybook for prototyp- ing components.",
      "highlights": []
    },
    {
      "company": "Tokéndex",
      "position": "Principle Developer",
      "website": "https://itunes.apple.com/us/app/tokendex/id1273909946?mt=8",
      "startDate": "2017-06-01",
      "endDate": "2017-09-01",
      "summary": "As a personal project I developed an iOS app utilizing React Native, Redux, redux-thunk and Expo to monitor blockchain cryptocurrencies, visualize trends in token prices, build a virtual portfolio, set the holdings of each currency to calculate the portfolio value. The project’s source code can be found on my github page. The application can be found on the App Store.",
      "highlights": []
    },
    {
      "company": "The LiRo Group",
      "position": "Project Engineer",
      "website": "https://www.governor.ny.gov/news/governor-cuomo-announces-transformational-plan-reimagine-new-york-s-bridges-and-tunnels-21st",
      "startDate": "2017-04-01",
      "endDate": "",
      "summary": "As a Project Engineer at a consultancy agency, I oversaw and inspected two projects commissioned by several state government agencies. Tasks included reviewing design drawings, verifying technical specifications, holding progress meetings to ensure timely completion of projects and also coordinating with manufacturers, designers, contractors, electricians and state agencies.",
      "highlights": []
    },
    {
      "company": "Shapeways",
      "position": "3D Printing Engineer",
      "website": "http://www.shapeways.com",
      "startDate": "2015-10-01",
      "endDate": "2017-03-01",
      "summary": "Worked closely with supply chain to create modular SQL queries in order to highlight and automate high priority PO’s. I then wrote a python script that would parse the results into an email using SMTP and automatically email the production team.\nCollaborated with supply chain and the factory management team to write SQL queries that would highlight various metrics in each department (throughput, lead time, reprit rate, complaints). Ran a local server (Python/Flask) to display the results using HTML/- Bootstrap/JS, C3.js and JSON.\nWorked with supply chain to write custom SQL queries in order to visualize the produc- tion pipeline vs. lead time in order to track and reduce late POs. The resulting graphs would update periodically. The program was hosted on a local server using Python/Flask, HTML/Bootstrap/JS, C3.js and JSON.",
      "highlights": []
    },
    {
      "company": "Pedal Power NYC - The Human Grid",
      "position": "Embedded Systems Intern",
      "website": "http://www.pedalpowernyc.org/",
      "startDate": "2013-06-01",
      "endDate": "2014-01-01",
      "summary": "Assisting in the documentation and design for a smart bicycle powered generator to power live concerts as part of an Open Source project. This included sensors on custom built bicycles, documenting wiring diagrams and network protocols to track how much power a user is inputting into the system. ",
      "highlights": []
    },
    {
      "company": "Senior Design",
      "position": "Electrical Engineer",
      "website": "http://www.eecs.ucf.edu/seniordesign/fa2010sp2011/g18/video.html",
      "startDate": "2010-08-01",
      "endDate": "2011-05-01",
      "summary": "Designed, documented and constructed an analog and digital musical synthesizer. Tasks included simulating the circuits, designing and manufacturing PCB, programming and uploading firmware to microcontrollers, soldering electronics and testing the final product. Other task included a budget const analysis and a critical path analysis for a time and efficient execution of milestones and goals.",
      "highlights": []
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "College of Electrical Engineering and Computer Science, UCF",
      "area": "Electrical Engineer",
      "studyType": "Bachelor",
      "startDate": "2007-08-01",
      "endDate": "2011-05-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Front End Development",
      "level": "Master",
      "keywords": [
        "Python",
        "SQL",
        "HTML",
        "CSS",
        "Javascript",
        "ES2015",
        "React",
        "React Native",
        "Redux",
        "redux-thunk",
        "Babel",
        "Bootstrap",
        "Node",
        "MySQL",
        "Github",
        "Responsive",
        "3D Printing",
        "CAD"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    }
  ],
  "interests": [],
  "references": []
}
